## plan
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eks_cluster.gkzz-dev-cluster will be created
  + resource "aws_eks_cluster" "gkzz-dev-cluster" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "gkzz-dev-cluster"
      + platform_version      = (known after apply)
      + role_arn              = (known after apply)
      + status                = (known after apply)
      + tags                  = {
          + "Name"                                        = "gkzz-dev-cluster"
          + "alpha.eksctl.io/cluster-name"                = "gkzz-dev-cluster"
          + "alpha.eksctl.io/eksctl-version"              = "0.77.0"
          + "eksctl.cluster.k8s.io/v1alpha1/cluster-name" = "gkzz-dev-cluster"
        }
      + tags_all              = {
          + "Name"                                        = "gkzz-dev-cluster"
          + "alpha.eksctl.io/cluster-name"                = "gkzz-dev-cluster"
          + "alpha.eksctl.io/eksctl-version"              = "0.77.0"
          + "eksctl.cluster.k8s.io/v1alpha1/cluster-name" = "gkzz-dev-cluster"
        }
      + version               = "1.21"

      + kubernetes_network_config {
          + service_ipv4_cidr = (known after apply)
        }

      + timeouts {}

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.gkzz-dev-node-group will be created
  + resource "aws_eks_node_group" "gkzz-dev-node-group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "SPOT"
      + cluster_name           = "gkzz-dev-cluster"
      + disk_size              = 20
      + id                     = (known after apply)
      + instance_types         = [
          + "t2.small",
          + "t3.small",
          + "t2.medium",
        ]
      + node_group_name        = "gkzz-dev-node-group"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = {
          + "Name"             = "gkzz-dev-node-group"
          + "eks/cluster-name" = "gkzz-dev-cluster"
        }
      + tags_all               = {
          + "Name"             = "gkzz-dev-node-group"
          + "eks/cluster-name" = "gkzz-dev-cluster"
        }
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 3
          + max_size     = 4
          + min_size     = 2
        }

      + timeouts {}

      + update_config {
          + max_unavailable            = (known after apply)
          + max_unavailable_percentage = (known after apply)
        }
    }

  # aws_iam_role.gkzz-dev-cluster-role will be created
  + resource "aws_iam_role" "gkzz-dev-cluster-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gkzz-dev-cluster-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.gkzz-dev-node-role will be created
  + resource "aws_iam_role" "gkzz-dev-node-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gkzz-dev-node-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.CloudWatchLogsFullAccess will be created
  + resource "aws_iam_role_policy_attachment" "CloudWatchLogsFullAccess" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchLogsFullAccess"
      + role       = "gkzz-dev-node-role"
    }

  # aws_iam_role_policy_attachment.gkzz-dev-AmazonEC2ContainerRegistryReadOnly will be created
  + resource "aws_iam_role_policy_attachment" "gkzz-dev-AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "gkzz-dev-node-role"
    }

  # aws_iam_role_policy_attachment.gkzz-dev-AmazonEKSClusterPolicy will be created
  + resource "aws_iam_role_policy_attachment" "gkzz-dev-AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "gkzz-dev-cluster-role"
    }

  # aws_iam_role_policy_attachment.gkzz-dev-AmazonEKSVPCResourceController will be created
  + resource "aws_iam_role_policy_attachment" "gkzz-dev-AmazonEKSVPCResourceController" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "gkzz-dev-cluster-role"
    }

  # aws_iam_role_policy_attachment.gkzz-dev-AmazonEKSWorkerNodePolicy will be created
  + resource "aws_iam_role_policy_attachment" "gkzz-dev-AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "gkzz-dev-node-role"
    }

  # aws_iam_role_policy_attachment.gkzz-dev-AmazonEKS_CNI_Policy will be created
  + resource "aws_iam_role_policy_attachment" "gkzz-dev-AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "gkzz-dev-node-role"
    }

  # aws_internet_gateway.gkzz-dev-igw will be created
  + resource "aws_internet_gateway" "gkzz-dev-igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "gkzz-dev-rt-assosication"
        }
      + tags_all = {
          + "Name" = "gkzz-dev-rt-assosication"
        }
      + vpc_id   = (known after apply)
    }

  # aws_launch_template.gkzz-dev-lt will be created
  + resource "aws_launch_template" "gkzz-dev-lt" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + latest_version         = (known after apply)
      + name                   = "gkzz-dev-lt"
      + name_prefix            = (known after apply)
      + tags_all               = (known after apply)
      + vpc_security_group_ids = (known after apply)

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name" = "gkzz-dev-lt"
            }
        }
    }

  # aws_main_route_table_association.gkzz-dev-rt-association will be created
  + resource "aws_main_route_table_association" "gkzz-dev-rt-association" {
      + id                      = (known after apply)
      + original_route_table_id = (known after apply)
      + route_table_id          = (known after apply)
      + vpc_id                  = (known after apply)
    }

  # aws_route_table.gkzz-dev-rt will be created
  + resource "aws_route_table" "gkzz-dev-rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "gkzz-dev-rt"
        }
      + tags_all         = {
          + "Name" = "gkzz-dev-rt"
        }
      + vpc_id           = (known after apply)
    }

  # aws_security_group.gkzz-dev-sg will be created
  + resource "aws_security_group" "gkzz-dev-sg" {
      + arn                    = (known after apply)
      + description            = "Allow 80 and 8000"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow 80 from anywhere for redirection"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow 8000 from anywhere for redirection"
              + from_port        = 8000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8000
            },
        ]
      + name                   = "gkzz-dev-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "gkzz-dev-sg"
        }
      + tags_all               = {
          + "Name" = "gkzz-dev-sg"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.gkzz-dev-subnet-public1a will be created
  + resource "aws_subnet" "gkzz-dev-subnet-public1a" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ap-northeast-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "192.168.0.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "gkzz-dev-subnet-public1a"
        }
      + tags_all                        = {
          + "Name" = "gkzz-dev-subnet-public1a"
        }
      + vpc_id                          = (known after apply)
    }

  # aws_subnet.gkzz-dev-subnet-public1c will be created
  + resource "aws_subnet" "gkzz-dev-subnet-public1c" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ap-northeast-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "192.168.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "gkzz-dev-subnet-public1c"
        }
      + tags_all                        = {
          + "Name" = "gkzz-dev-subnet-public1c"
        }
      + vpc_id                          = (known after apply)
    }

  # aws_vpc.gkzz-dev-vpc will be created
  + resource "aws_vpc" "gkzz-dev-vpc" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "192.168.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = false
      + enable_classiclink_dns_support   = false
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name" = "gkzz-dev-vpc"
        }
      + tags_all                         = {
          + "Name" = "gkzz-dev-vpc"
        }
    }

Plan: 18 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster-name                          = "gkzz-dev-cluster"
  + endpoint                              = (sensitive value)
  + kubeconfig-certificate-authority-data = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```